[{"disclosure": "gri_2-22", "section_ids": ["mastercard-esg-2022-121"], "completeness": 2, "materiality": 3, "comment": " The paragraph only vaguely mentions the relevance of sustainable development and strategy. It lacks explicit information about the company's sustainable development strategy and climate goals, and does not provide specific examples or details. The connection to the business and stakeholders is not clearly demonstrated, and the significance of the topic is not fully explained."}, {"disclosure": "gri_2-29", "section_ids": ["mastercard-esg-2022-15"], "completeness": 7, "materiality": 8, "comment": " The paragraph reasonably well addresses the disclosure by providing information on the process for identifying relevant stakeholders across the value chain and considering their needs in decision-making. It covers the key elements of stakeholder engagement, although it lacks specific examples or details. The importance of stakeholder engagement is indicated, but there could be more context or explanation of its significance to the business and stakeholders."}, {"disclosure": "gri_201-2", "section_ids": ["mastercard-esg-2022-33"], "completeness": 3, "materiality": 7, "comment": " The completeness score is low because the paragraph only briefly mentions the risks and opportunities posed by climate change without providing explicit and detailed information about the financial implications and specific risks and opportunities faced by the company. The materiality score is higher because the paragraph indicates some relevance by discussing the company's efforts in managing climate-related risks and opportunities, including engaging external consultants and acknowledging the potential disruptions to operations and customer service. However, it lacks full context or explanation of significance to demonstrate a clear connection to business and stakeholders."}, {"disclosure": "gri_302-2", "section_ids": ["mastercard-esg-2022-117"], "completeness": 0, "materiality": 0, "comment": "This disclosure is not addressed in the provided paragraphs. Therefore, the completeness and materiality scores are both 0. The paragraphs do not mention anything related to the energy consumption outside the company, hence there is no content to evaluate."}, {"disclosure": "gri_302-4", "section_ids": ["mastercard-esg-2022-16", "mastercard-esg-2022-18"], "completeness": 3, "materiality": 2, "comment": " The paragraph only briefly mentions the reduction of energy consumption without providing specific initiatives or detailed information. It lacks clarity and depth in addressing the disclosure. The mention of reducing emissions and resource use across the value chain is vague and lacks specific examples or details. The connection to the business and stakeholders is not clearly demonstrated, and the importance of the topic is not explained, resulting in a low materiality score."}, {"disclosure": "gri_302-5", "section_ids": ["mastercard-esg-2022-55"], "completeness": 5, "materiality": 7, "comment": "This topic is important for stakeholders to understand the company's efforts to reduce energy requirements in its products and services, which aligns with sustainability goals and could potentially reduce environmental impact and costs. It is also relevant in the context of increasing energy efficiency and addressing climate change issues.The paragraph partially addresses the disclosure by mentioning the reduction in energy requirements of products and services. However, it lacks specific details or examples of how the company is achieving these reductions.The paragraph indicates relevance by highlighting the importance of reducing energy requirements in products and services and its alignment with sustainability goals. It provides some context"}, {"disclosure": "gri_303-5", "section_ids": ["mastercard-esg-2022-119"], "completeness": 0, "materiality": 0, "comment": "This disclosure is not addressed in the provided paragraphs. Therefore, the completeness and materiality scores are both 0. The paragraphs do not mention anything about water consumption, therefore the disclosure is not addressed at all."}, {"disclosure": "gri_305-1", "section_ids": ["mastercard-esg-2022-116", "mastercard-esg-2022-17", "mastercard-esg-2022-18", "mastercard-esg-2022-5", "mastercard-esg-2022-128", "mastercard-esg-2022-55", "mastercard-esg-2022-33", "mastercard-esg-2022-23"], "completeness": 2, "materiality": 3, "comment": " The paragraph partially addresses the disclosure by mentioning the reduction in emissions and resource use, use of renewable energy, and engagement with external consultants. However, it lacks explicit and detailed information about the company's Scope 1 greenhouse gas emissions. The relevance of the disclosure to the business and stakeholders is vaguely mentioned without a clear demonstration of importance or connection to strategy, risk, or stakeholder concerns."}, {"disclosure": "gri_305-2", "section_ids": ["mastercard-esg-2022-116", "mastercard-esg-2022-17", "mastercard-esg-2022-18", "mastercard-esg-2022-5", "mastercard-esg-2022-128"], "completeness": 2, "materiality": 3, "comment": " The paragraph only partially addresses the disclosure as it mentions the reduction of emissions in the supply chain and some operational activities, but lacks specific details about the indirect GHG emissions (Scope 2) and how they are being managed. The materiality is low because there is minimal connection to the business or stakeholders, and the significance of the disclosure is not clearly demonstrated. The generic statements about climate change and reducing emissions do not provide context specific to the company's operations or stakeholder concerns."}, {"disclosure": "gri_305-3", "section_ids": ["mastercard-esg-2022-116", "mastercard-esg-2022-17", "mastercard-esg-2022-18", "mastercard-esg-2022-5", "mastercard-esg-2022-128", "mastercard-esg-2022-55", "mastercard-esg-2022-33", "mastercard-esg-2022-23"], "completeness": 3, "materiality": 2, "comment": " The disclosure partially addresses the Scope 3 greenhouse gas emissions by mentioning the reduction in emissions in the supply chain and the commitment to managing impacts across the value chain. However, it lacks specific details such as the total Scope 3 emissions, the categories included, and the methods used for calculation. The materiality is low as there is minimal connection to the business or stakeholders, and the importance of addressing Scope 3 emissions is not clearly demonstrated."}, {"disclosure": "gri_305-4", "section_ids": ["mastercard-esg-2022-116", "mastercard-esg-2022-18"], "completeness": 2, "materiality": 3, "comment": " The paragraph partially addresses the disclosure by mentioning the reduction in GHG emissions intensity and providing some information about the company's supply chain emissions. However, it lacks explicit and detailed information about the GHG emissions intensity ratio for the company. The relevance of the disclosure to the business and stakeholders is mentioned but lacks a clear demonstration of why it is important."}, {"disclosure": "gri_305-5", "section_ids": ["mastercard-esg-2022-116", "mastercard-esg-2022-17", "mastercard-esg-2022-18", "mastercard-esg-2022-54", "mastercard-esg-2022-16", "mastercard-esg-2022-128", "mastercard-esg-2022-33", "mastercard-esg-2022-55", "mastercard-esg-2022-22"], "completeness": 4, "materiality": 5, "comment": " The disclosure partially addresses the reduction of GHG emissions. It mentions the company's commitment, efforts to reduce emissions in its supply chain, and engagement with suppliers, but lacks specific details such as emission reduction targets, progress, and initiatives. The relevance to the business and stakeholders is indicated through the discussion of environmental sustainability and supplier engagement, but the specific significance or alignment with strategy, risk, or stakeholder concerns is not clearly demonstrated."}, {"disclosure": "gri_306-2", "section_ids": ["mastercard-esg-2022-127"], "completeness": 5, "materiality": 5, "comment": " The paragraph partially addresses the disclosure by mentioning the company's goal to achieve sustainable management of natural resources and reduce waste generation by 2030. However, it lacks explicit information on waste treatment methods and efforts to reduce waste generation. The paragraph indicates some relevance to the business and stakeholders by highlighting the company's efforts to design environmentally conscious products and solutions, recycling electronic waste, and focusing on sustainable consumption and production patterns. However, it lacks full context or explanation of the significance of waste management to the business and stakeholders."}, {"disclosure": "gri_306-3", "section_ids": ["mastercard-esg-2022-118", "mastercard-esg-2022-24"], "completeness": 7, "materiality": 8, "comment": " The paragraph reasonably well addresses the waste generated disclosure by providing specific information about the company's efforts to recycle electronic waste and achieve TRUE certification for waste reduction. However, it lacks explicit information about the total amount of waste generated, which would provide a more complete picture. The materiality score is high as the paragraph demonstrates the company's commitment to responsible waste management and aligns with stakeholder interest in environmental sustainability and data privacy."}, {"disclosure": "gri_308-1", "section_ids": ["mastercard-esg-2022-22", "mastercard-esg-2022-55"], "completeness": 5, "materiality": 7, "comment": " The paragraph reasonably addresses the disclosure by providing details on the environmental screening process for new suppliers, including the use of the CDP Climate Change Questionnaire and efforts to collaborate with suppliers to reduce emissions. However, it lacks specific examples or details on the environmental criteria used for screening. The paragraph indicates the importance of the disclosure to the business by mentioning the improvement in the percentage of Tier 1 suppliers responding to the CDP Climate Change Questionnaire and the initiatives to decarbonize the supply chain. However, it could provide more context on how these efforts"}, {"disclosure": "gri_308-2", "section_ids": ["mastercard-esg-2022-22", "mastercard-esg-2022-55", "mastercard-esg-2022-54"], "completeness": 2, "materiality": 5, "comment": " The disclosure partially addresses the GRI disclosure on negative environmental impacts in the supply chain and actions taken. The first paragraph provides some details about the environmental sustainability supplier engagement model and initiatives taken to reduce emissions, but lacks specific examples or details about the assessment of suppliers for environmental impacts. The second paragraph mentions efforts to reduce greenhouse gas emissions, increase supplier diversity, and ensure suppliers protect human rights, but does not provide explicit information on actions taken to address negative environmental impacts in the supply chain. The materiality score is 5 because while the disclosure indicates"}, {"disclosure": "gri_403-2", "section_ids": ["mastercard-esg-2022-114"], "completeness": 3, "materiality": 7, "comment": " The paragraph partially addresses the disclosure by mentioning the use of a risk assessment framework and the consideration of various risks, but lacks specific details on the processes used to identify work-related hazards and assess risks. The connection to the importance of the topic for the business and stakeholders is somewhat clear, as it mentions that the results feed into board updates and considers ESG-related risks."}, {"disclosure": "gri_405-1", "section_ids": ["mastercard-esg-2022-35", "mastercard-esg-2022-61"], "completeness": 7, "materiality": 6, "comment": " The disclosure reasonably covers the key elements of diversity in governance bodies and employees, including details about governance guidelines, management committee activities, regional and functional plans, and DEI team activities. However, it lacks specific examples or detailed information about the actual diversity representation. It indicates relevance to the business and stakeholders, but it could provide more context or explanation of the significance of diversity to the company and its stakeholders."}]